export const headerLang = {
  text1: "AIRLINE",
  text2: "TICKET",
};
export const adText = {
  l1: "株主優待券番号をメールで受取り",
  l2: "「断然」安くフライトする",
  // "l3": "する"
};

export const shBenefits = {
  header: "株主優待割引適用後料金",
  buyNow: "今すぐ購入する",
  buyNow1: "今すぐ",
  buyNow2: "購入",
  buyNow3: "する",
};

export const fop = {
  header: "購入フロー",
};

export const customerData = {
  customerInfoHeader: "お客様情報の入力",
  formRequiredTxt: "必須",
  loginToggleText: "入力を省略する（当サイトで購入したことがある方）",
  customerDetailsApply:
    "下記お客さま情報を全てご記入いただき、お申し込みボタンをクリックしてください。",
  nameOfTheCustomer: "お名前",
  phonetic: "フリガナ",
  nowLogged: "あなたは今ログインしています",
  loginInfoTxt: "以下の情報を入力しログインして下さい",
  login: "ログイン",
  reqFieldError: "必須フィールド",
  emailError: "君のメールアドレスが違うよ",
  passwordError: "パスワードが無効です",
  emailAddress: "メールアドレス",
  password: "パスワード",
  postalCode: "郵便番号",
  prefecture: "都道府県",
  address1: "住所1（市郡区／町・村）",
  address2: "住所2（丁目・番地）",
  address3: "住所3（建物名・号室）",
  phoneNumber: "電話番号",
  confirmMail: "メールアドレス（確認）",
  sex: "性別",
  birthday: "生年月日",
  productInfoTxt: "商品情報",
  selectProductTxt: "商品を選択",
  productName: "商品名",
  productPrice: "価格",
  qtyToPurchase: "購入数",
  terms_11: "以下の各事項を確認の上で申し込みます。",
  terms_l3: "ご購入についての利用規約に同意していること。",
  terms_14: "（ 未成年の場合）法定代理人の同意を得ていること。",
  terms_15: "返品についてはこちら",
  clickToBuy: "申込内容を確認する",
  agreeTermsErr: "製品を注文するには、利用規約に同意する必要があります",
  emailNotReceived: "メールアドレスが間違っていると、メールが届きません",
  passwordErrNumbers: "少なくとも8文字である必要があります",
  enterkatakana: "カタカナで入力してください",
  enterInteger: "整数を入力してください",
};

export const privacy = {
  header: "プライバシーポリシー",
  subTitle:
    "株式会社エム・ケー・ケー(以下、「当社」といいます)では、お客様からお預かりする個人情報の重要性を認識し、お客様に安心してご利用いただけるように以下のプライバシーポリシーを定めております。",
  privacyData: [
    {
      head: "個人情報の定義",
      value:
        "本プライバシーポリシーにおける｢個人情報｣とは、氏名、生年月日、Eメールアドレスなどの記述等により特定の個人を識別することができるものをいいます。",
    },
    {
      head: "個人情報の取得収集･利用",
      value:
        "お客様の情報を取得するにあたっては、利用目的を明記の上、適正かつ公正な手段で、お客様の了承を得て収集します。",
      l2:
        "当社はお客様のIPアドレス、クッキー情報、閲覧・検索したページなどの情報をお客様のブラウザから自動的に受け取り、サーバーに記録します",
    },
    {
      head: "個人情報の利用",
      value:
        "お客様の個人情報は下記場合にのみ利用し、それ以外の目的には利用しません。",
      subHead: {
        head: "[利用目的]",
        children: [
          "お客様がご希望されている場合のみ、電子メールアドレスにメールマガジン、ダイレクトメールを送信する場合",
          "お客様がご購入された商品、またはご応募されたプレゼントの発送を行う場合",
          "当社がお客様に何らかの連絡が必要であると判断した場合",
          "お客様からのお問合せに対して回答を行う場合",
          "お客様に対して、アンケートおよびモニターを実施する場合",
          "お客様の属性（年齢、住所等）ごとに分類された統計的資料を作成する場合",
          "お客様それぞれの嗜好に適合した情報発信やサービスを提供、表示する場合",
        ],
      },
      anotherHead: {
        head: "[共同利用]",
        value:
          "当社にて総合的なサービスを提供するため、必要な保護措置を講じた上で、お客様の個人情報を共同利用させていただきます。",
      },
    },
    {
      head: "個人情報の管理",
      value:
        "お客様から収集させていただいた個人情報は、当社によって適切、かつ厳重に管理し、お客様の個人情報への不正なアクセスや情報の紛失、破壊、改竄及び遺漏等が起きぬよう、予防ならびに安全策を講じます。",
    },
    {
      head: "個人情報の開示",
      value:
        "当社は、お客様より収集させていただいた個人情報は、以下の何れかに該当する場合を除き、第三者に提供、開示等することはありません。",
      subHead: {
        children: [
          "お客様の事前の同意･承諾を得た場合",
          "予め当社との間で機密保持に関する契約を締結している会社などに、必要な範囲内で開示･提供する場合",
          "お客様からのお問合せに対する回答等で、機密保持に関する契約を締結している会社等から直接ご連絡させていただくことが適切と判断される場合",
          "法令等により開示･提供が必要な場合",
        ],
      },
    },
    {
      head: "個人情報の開示先の管理",
      value:
        "当社が、上記におけるお客様の承諾に基づき個人情報を開示･提供する会社等には、お客様の個人情報を漏洩、再提供等しないよう契約により義務づけ、当社と同様の厳重な管理を実施させます。",
    },
    {
      head: "リンク先における個人情報の保護",
      value:
        "本サイトからリンクする当社以外のウェブサイトにおける個人情報の取扱いについては、リンク先の個人情報保護に関する取扱い規定をご確認の上、お客様ご自身でご対応くださいますようお願いいたします。",
      l2:
        "リンク先における個人情報の取扱いをはじめ、一切の事項について当社は責任を負いかねます。予めご了承ください",
    },
    {
      head: "個人情報に対する取り組みの継続的改善",
      value:
        "当社は、当社が保有する個人情報に関して適用される法令･規範を遵守するとともに、上記各項における取り組みを適宜見直し、改善に努めます。",
    },
    {
      head: "お問合せ",
      value: "お問い合わせフォームからからお願いいたします。",
    },
    {
      head: "プライバシーポリシーの変更",
      value:
        "当社は、個人情報の保護に関する法律をはじめ、その他の関連法令・ガイドライン等の変更に伴い、本プライバシーポリシーを変更することがあります。",
      l2: "その場合、本サイトへの変更をもって公表とさせていただきます。",
    },
  ],
};

export const faq = {
  header: "よくあるご質問",
  showLess: "Show Less",
  questionList: [
    {
      "q": "決済メールが届かないのですが？",
      children: [
        "受信側の迷惑メール設定や受信拒否設定、なりすまし規制等により、迷惑フォルダや削除フォルダ等にメールが自動で振り分けられている可能性が考えられます。",
        "一度、振り分け設定や、迷惑フォルダ等のご確認をお願いいたします。"
      ]
    },
    {
      q: "クレジット決済は安全でしょうか？",
      children: [
        "本サービスは、お客様のクレジット決済情報は保存せず、経済産業省が推進する「カード情報の非保持化」を行っております。"
      ]
    },
    {
      q: "３Dセキュアとは何ですか？",
      children: [
        "ビザ・インターナショナルが開発したインターネットにおけるカード決済を安全に行う仕組みです。",
        "カード番号と有効期限に加えてお客さま本人しか知り得ないパスワードを入力することにより、安心してカード決済を行うことが可能となります。",
        "Mastercardが3Dセキュアの仕様に準拠したサービスを展開しており、それぞれで名称が異なりますが、総称して本人認証サービスと呼ばれています。",
        "本サービスは、3Dセキュア、常時SSLを導入することで、成り済まし、通信の安全性、不正アクセス（盗聴）の防止などの安全性の高いセキュリティ対策を行っております。",
        "参考：３Dセキュアについて各社のリンク先",
        "VISAカード、マスターカード"
      ]
    },
    {
      q: "ANA(全日空)を購入したのですが、JAL(日本航空)に変更は可能でしょうか？",
      children: [
        "クレジット決済完了後の変更はできません。ご利用の航空会社をご確認の上ご購入をお願いいたします。"
      ]
    },
    {
      q: "お申込みかかる時間はどのくらいですか？",
      children: [
        "お申込み完了、ご決済完了時には、数秒又は数十秒以内に自動返信メールが届きます。",
        "お申込みから数分で株主優待の番号情報が利用可能です。"
      ]
    },
    {
      q: "領収書の宛名は変更できますか？",
      children: [
        "変更可能です。",
        "決済完了時の自動返信メールの本文中に、株主優待番号と登録用パスワード（ANA全日空）もしくは発券用コード（JAL日本航空）の記載とともに、領収書出力のURLの記載があります。",
        "このURLにアクセスしていただくと、宛名入力の画面になりますので、こちらでお客様にご変更いただきます。",
        "詳しくは、領収書に関する操作方法 をご参照ください。"
      ]
    },
    {
      q: "領収書の分割は、可能ですか？",
      children: [
        "はい可能です。",
        "ただし、システムの領収書の分割発行の機能はございません。",
        "お問い合わせフォームより、決済番号および宛名等のご連絡ください。領収書を分割の上、メールにてお送りいたします。"
      ]
    },
    {
      q: "購入した番号はどのように使うのでしょうか？",
      children: [
        "ご購入いただいた番号の利用法については、ANAおよびJALの公式サイトをご参考ください。",
        "ANA株主優待割引のご利用方法について",
        "JAL国内線 - 株主割引のご利用方法について"
      ]
    },
    {
      q: "購入した株主優待番号はゴールデンウィーク・夏休み・年末年始などでも使えますか？",
      children: [
        "はい使用可能です。",
        "株主優待割引運賃用の座席に空席があれば、ANAの「株主優待番号ご案内書」もしくは、JALの「株主優待券」の有効期間内でいつでもご利用になれます。",
        "ご購入の前、座席に空席があるかご確認されることをお勧めします。"
      ]
    },
    {
      q: "コードシェア（共同運航）便でも使えますか？",
      children: [
        "はい使用可能です。",
        "ANA（全日空）およびJAL（日本航空）の株主優待券利用可能な便は下記の通りです。"
      ],
      block: [
        {
          "header": "ANA",
          "value": "ANA国内便およびエア・ドゥ（ADO）・IBEXエアラインズ（IBX） ・ソラシドエア（SNA）・スターフライヤー（SFJ）・オリエンタルエアブリッジ（ORC）が運航するANA便名のコードシェア便が利用可能です。"
        },
        {
          "header": "JAL",
          "value": "JAL国内便、日本トランスオーシャン航空（JTA）・日本エアコミューター（JAC）・琉球エアーコミューター（RAC）便および フジドリームエアラインズ（FDA）、天草エアライン（AMX）とのコードシェア便が利用可能です。"
        }
      ]
    },
    {
      q: "ANA・JAL株主優待番号販売センターで番号を購入するのと、現物の株主優待券を利用するのとではどう違うのですか？",
      children: [

        "株主優待枠で飛行機を乗るための必要手続きはどちらも全く同じです。",
        "株主優待券が有る場合、スクラッチを削って、番号登録をしますが、この作業をANA・JAL株主優待番号販売センターが代行しているとお考えください。",
        "ただし、現物の優待券はお手元に残りません。ご注意ください。",
        "※当社は関連会社にて金券ショップを運営しておりますので、金券ショップでの購入ももちろんオススメしております。"
      ]
    },
    {
      q: "クレジットカード会社からの明細書に表記されている請求名は？",
      children: [
        "ご利用頂いたカード会社からの請求書に記載される請求名は、当サイトを運営管理している「(株) エム・ケー・ケー」となっております。"
      ]
    }
  ]
}

export const footer = {
  privacyPolicy: "プライバシーポリシー",
  faq: "よくある質問",
};

export const confirmation = {
  orderConfirmationHeader: "ご注文確認画面",
  orderConfirmationTab: "ご注文内容の確認",
  orderCompletionTab: "ご注文完了",
  checkDetails: "ご注文内容を確認ください",
  unitPrice: "単価",
  number: "個数",
  subtotal: "小計",
  total: "合計",
  plsCheck: "必ずご確認ください",
  orderedProduct: "予約商品です",
  reservedProduct: "予約商品です",
  afterOrdering: "ご注文後のキャンセルはお受けできません。",
  customerInformationCheck: "お客様情報をご確認ください",
  stsAddress: "住所",
  buyTicket: "ご注文完了へ",
};

export const orderCompletion = {
  orderCompleteHeader: "注文完了画面",
  orsCompleted: "ご注文完了",
  completionInformation: "ご注文内容",
  orsNumber: "ご注文番号",
  yourOrder: "ご注文いただきありがとうございます。",
  registeredLater:
    "ご注文内容はご登録いただいたメールアドレスに送付いたします。",
  isCorrect: "ご注文内容が正しいことをご確認ください",
  emailFolder:
    "5分以内にメールが届かない場合、迷惑メールに届いている可能性があります。",
  mailJunkFolder: "迷惑メールフォルダをご確認下さい。",
  contactEmailAddress:
    "ご質問がある場合、下記のメールアドレスまでご連絡ください。",
  mail: "メール",
};

export const discountBanner = {};

export const termsAndConditions = {
  header: "利用規約",
  subTitle:
    "",
  privacyData: [
    {
      head: "一般規約",
      children: [{
        subHead: "[第1条] 総則",
        value: {
          data: "株式会社エム・ケー・ケー(以下、「当社」といいます)は、「ANA・JAL株主優待番号販売センター」(以下、「本サイト」といいます)において、提供するサービスの利用規約として、本規約を定めます。",
          children: []
        }
      }, {
        subHead: "[第2条] 規約の範囲と変更",
        value: {
          data: "",
          children: [
            " 本規約は本サイトをご利用いただくすべての利用者に適用されるものとします。",
            " 当社は、利用者の承諾を得ることなくいつでも必要に応じて本規約を変更することができるものとします。変更後の本規約は、当社が別途定める場合を除き、本サイト上に表示した時点より効力を生じるものとし、利用者が本サイトをご利用された際は、利用者は当該変更に同意され承諾されたものとみなします。",
            " 利用者に何らかの障害が生じた場合であっても、当社は一切の責任を負いません。"
          ]
        }
      }, {
        subHead: "[第3条] 本サービスの利用",
        value: {
          data: "",
          children: [
            " 当社は、日本国内からアクセスされた利用者に対して本サービスを提供します。",
            " 利用者は、本規約に従い、本サイトをご利用いただきます。",
            " 本サイトを利用するために必要となる通信機器やソフトウェア、それに付随して必要となる機器やサービスへの加入等で発生する費用、通信料は利用者ご自身の負担となります。",
            " 本サイトのご利用に関連して、利用者が本サイトまたは他の利用者に対して迷惑または損害を与えた場合、または紛争を生じた場合、当該利用者は自己の費用と責任でかかる問題・損害・紛争を解決するものとし、当社に対して何等の迷惑または損害等を与えてはなりません。"
          ]
        }
      }, {
        subHead: "[第4条] 著作権等",
        value: {
          data: "",
          children: [
            " 無断で本サイト上のコンテンツを複製、転載、改編、編集、頒布、販売等することはできません。",
            " 当社は利用者が情報等を当社に送付した時点で、利用者がその情報に関する一切の権利を放棄されたものとみなします。当社は情報等に関して一切の守秘義務を負わず、将来にわたりあらゆる目的にその情報提供者に対価を支払うことなく使用できるものとし、その情報等から生じるいかなる問題について一切責任を負いません。"
          ]
        }
      }, {
        subHead: "[第5条] 禁止事項",
        value: {
          data: "利用者は本サイトのご利用にあたって、以下の行為をしてはなりません。",
          children: [
            " 当社または第三者の財産権、プライバシーその他の権利を侵害する行為、またはその恐れのある行為。",
            " 当社または第三者に迷惑、不利益もしくは損害を与える行為、またはその恐れのある行為。",
            " 当社または第三者に対して事実に反する情報他、公序良俗に反する、またはその恐れのある情報を提供する行為。",
            " 犯罪行為、公序良俗に反する行為、その他法令に違反する行為、またはその恐れのある行為。",
            " 転売、再販売、その他営利を目的として本サイトを利用する行為。",
            " その他、当社が不適切と判断する行為。"
          ]
        }
      }, {
        subHead: "[第6条] 個人情報の管理",
        value: {
          data: "当社は、利用者の個人情報(以下、「個人情報」という)を別途掲示する「プライバシーポリシー」に基づき、適切に取扱います。",
          children: [

          ]
        }
      }, {
        subHead: "[第7条] 本サービスの中止・中断",
        value: {
          data: "当社は、本サイトの稼働状況を保つため、次の各号のいずれかに該当する場合、利用者に事前に通知を行うことなく本サイトの提供の全部あるいは一部を中止できるものとします。",
          children: [
            " 当社における本サイトの定期保守または緊急保守を実施する場合。または工事上、止むを得ない場合。",
            " 天災、停電、戦争等の不可抗力や第三者による妨害行為等により、サービスの提供が困難になった場合。",
            " その他、運営上、技術上、当社が本サイトの一時的な中断を必要と判断した場合。"
          ]
        }
      }, {
        subHead: "[第8条] 免責事項",
        value: {
          data: "",
          children: [
            " 当社は、本サービスの内容および利用者が本サイトを通じて知り得る情報等について、その完全性、正確性、有用性等に関し、いかなる責任も負いません。",
            " 本サイトに掲載されている情報、画像およびリンク等を利用することにより、利用者の機器等に損害が発生した場合、またはウイルスに感染した場合等について、当社はいかなる責任も負いません。",
            " 当社は、利用者が本サイトを利用できなかったことにより発生した一切の損害について、その理由の如何にかかわらず、いかなる責任も負いません。"
          ]
        }
      }
      ]
    },
    {
      head: "売買規約",
      children: [{
        subHead: "[第9条] 販売条件",
        value: {
          data: "",
          children: [
            " 本サイトの注文フォーム(PC・モバイル)によるご注文のみお受けします。お電話・FAX・電子メール等によるご注文には応じかねます。",
            " 本サイトに掲載された商品情報は、予告なしに変更することがあります。",
            " 本サイト掲載の商品につきましては、お取扱いが可能な商品であり、ご注文時における商品確保を保証するものではございません。"
          ]
        }
      }, {
        subHead: "[第10条] 販売価格",
        value: {
          data: "",
          children: [
            "掲載商品および価格につきましては細心の注意を払っておりますが、人為的なミスにより、本サイト上の価格が実際の販売価格と異なる場合がございます。",
            "その際はたいへん申し訳ございませんが、民法95条「錯誤」により当該商品販売を無効とさせていただく場合がございますので、予めご了承ください。",
            "その場合には、当社が適当と思われる連絡方法において、ご注文後に正規の価格をご連絡し、ご購入の意思確認をさせていただくか、または再度新規でご注文いただくなどの対応をさせていただきます。"
          ]
        }
      }, {
        subHead: "[第11条] ご注文と成約",
        value: {
          data: "",
          children: [
            " お客様がクレジット決済画面にて決済が完了し、お客様に番号等をご連絡した時点で、売買契約は成立するものとします。",
            " 未成年者のご注文については保護者の責任において行動されたものとみなします。",
            " お客様がクレジット決済画面にて決済が完了した後、直ちにご購入内容の確認のため、確認メールを送信させていただきます。このメールには、ご注文内容、ご注文金額、ご注文番号などの大切な内容が記載されておりますので、必ず内容をご確認ください。また、当店へのお問合せにはご注文番号が必要となります。",
            {
              name: "契約成立の如何に関わらず、以下の理由に該当する場合は、当社は無条件でご注文をお断りすることができます",
              children: [
                " 個人情報に虚偽の事実が認められた場合。",
                "転売、再販売または営利目的の恐れがあるご注文をお受けした場合。",
                "その他、当社がご注文のお断りの必要を認めた場合。"
              ]
            }

          ]
        }
      }, {
        subHead: "[第12条] 商品の情報",
        value: {
          data: "",
          children: [
            " 当社は、本サイト上の商品説明をできる限り正確に表示するよう努めます。",
            " 商品画像はイメージであり、テキストの商品情報と異なる場合、テキストの商品情報が優先します。"
          ]
        }
      }, {
        subHead: "[第13条] お支払い",
        value: {
          data: "",
          children: [
            " 商品購入の際のお支払方法は、クレジットカード決済のみとします。",
            " クレジットカード決済の支払い期日までにまでにお支払いが確認できない場合、ご注文をキャンセルさせていただきます。",
            " サイトに関連した支払いに関して、クレジットカード会社、立替代行業者等の間で料金その他の債務を巡って紛争が発生した場合、当該当事者と直接解決するものとし、当社には一切責任がないものとします。"
          ]
        }
      }, {
        subHead: "[第14条] キャンセル・返金",
        value: {
          data: "本サイトでは、契約成立後のお客様の都合によるキャンセル・返金はいかなる場合にも受付けません。あらかじめご了承ください。",
          children: []
        }
      }
      ]
    },
    {
      head: "雑則",
      children: [{
        subHead: "[第15条] 不可抗力",
        value: {
          data: "天変地異、戦争、暴動、内乱、革命、法令の改廃制定、裁判所もしくは行政当局による命令処分、輸送機関の事故、その他の不可抗力により契約の履行が遅延し、または不可能となったときは、当社は利用者に対し何等の責任も負いません。",
          children: []
        }
      }, {
        subHead: "[第16条] 管轄裁判所",
        value: {
          data: "",
          children: [
            " 利用者と当社との間の本サイトの利用に関して、本規約により解決できない問題が生じた場合、利用者と当社とは誠意をもって協議し、これを解決するものとします。",
            " 前項の規定にも関わらず、協議によっても解決しない場合には、東京簡易裁判所または東京地方裁判所を第一審の専属管轄裁判所とします。"
          ]
        }
      }, {
        subHead: "[第17条] 準拠法",
        value: {
          data: "本利用規約の成立、効力、履行および解釈については、日本法を準拠法とします",
          children: []
        }
      }]
    }
  ],
};


export const contactUs = {
  header: "お問い合わせ",
  leftSection: [
    "当サイト運営会社は航空会社ではありません。",
    "株主の方等、航空会社へのお問合せにはお答えできかねますのでご了承ください。",
    "お問い合わせのご返答にはお時間を頂く場合がございます。",
    "当日・明日のお問い合わせ、その他お急ぎの場合は、恐れ入りますがお電話にてお問い合わせくださいますようお願い致します。",
    "※", "は必須項目です。"
  ],
  rightSection: {
    t1: " お急ぎの場合は",
    t2: "お電話にてお問い合わせください ",
    t3: "ANA・JAL株主優待番号販売センター",
    telephone: "03-6206-1540"
  }
}